import numpy as np
import pandas as pd

df1 = pd.DataFrame({'序号': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
                    '年级': ['大一', '大二', '大三', '大四', '大二', '大一', '大四', '大一', '大二', '大四', '大三', '大一'],
                    '姓名': ['马金花', '李昌贵', '王建国', '黎锦熙', '繁茂森', '张善民', '廖云龙', '刘盛喜', '马明全', '李意', '刘六一', '陈超'],
                    '年龄': [18, 19, 20, 21, 19, 18, 21, 18, 19, 22, 21, 19],
                    '性别': ['女', '男', '男', '女', '男', '男', '男', '女', '男', '女', '女', '男'],
                    '身高': [160, 168, 175, 166, 172, 180, 178, 158, 167, 165, 170, 185],
                    '体重': [48, 68, 72, 53, 75, 65, 80, 46, 64, 56, 60, 78]})
df2 = pd.DataFrame({'BMI': list(df1['体重'] / (df1['身高'] * df1['身高'] / 10000))})
df3 = pd.concat([df1, df2], join='outer', axis=1)
print("增加BMI")
print(df3)

# print("大一信息：")
# for item in df3.groupby(by='年级'):
#     if item[0] == '大一':
#         print(item)

print("大一信息：")
df5 = dict([x for x in df3.groupby('年级')])['大一']
print(df5)
print("大一平均体重：", dict([x for x in df3.groupby('年级')])['大一']['体重'].mean())
print("大四平均体重：", dict([x for x in df3.groupby('年级')])['大四']['体重'].mean())
