import pandas as pd

score1 = pd.read_excel(r'E:\Hchier\A\华清远见实训日志\data\scores.xlsx', index_col=0, header=[0, 1])

# 一本文科最大分
print("一本文科最大分:", max(score1['一本分数线', '文科']))
# 一本理科最大分
print("一本理科最大分:", max(score1['一本分数线', '理科']))
# 一本分数线文科理科最大差
print("一本分数线文科理科最大差:", max(score1['一本分数线', '文科'] - score1['一本分数线', '理科']))
# 一本分数线文科理科最小差
print("一本分数线文科理科最小差:", min(score1['一本分数线', '文科'] - score1['一本分数线', '理科']))

# 2020与2019比，一、二本理科分数线变化
print("2020与2019比，一本理科分数线变化:", (score1['一本分数线', '理科'][2020] - score1['一本分数线', '理科'][2019]))
print("2020与2019比，一本文科分数线变化:", (score1['一本分数线', '文科'][2020] - score1['一本分数线', '文科'][2019]))
print("2020与2019比，二本理科分数线变化:", (score1['二本分数线', '理科'][2020] - score1['二本分数线', '理科'][2019]))
print("2020与2019比，二本文科分数线变化:", (score1['二本分数线', '文科'][2020] - score1['二本分数线', '文科'][2019]))


sum11 = 0
sum12 = 0
sum21 = 0
sum22 = 0
for i in range(2010, 2021):
    sum11 += score1['一本分数线', '文科'][i]
    sum12 += score1['一本分数线', '理科'][i]
    sum21 += score1['二本分数线', '文科'][i]
    sum22 += score1['二本分数线', '理科'][i]

print("一本文科平均：", sum11/11)
print("一本理科平均：", sum12/11)
print("二本文科平均：", sum21/11)
print("二本理科平均：", sum22/11)
print()

print(score1.mean())